#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
#### Terraform Test 🧪``

<details><summary>Show Plan</summary>

```

terraform
data.external.build_layer: Reading...
module.apply_schema_lambda.data.external.archive_prepare[0]: Reading...
module.sync_lambda.data.external.archive_prepare[0]: Reading...
random_id.bucket_suffix: Refreshing state... [id=3wj6Eg]
module.weekly_report_lambda.data.external.archive_prepare[0]: Reading...
module.ingestion_lambda.data.external.archive_prepare[0]: Reading...
module.reprocess_lambda.data.external.archive_prepare[0]: Reading...
module.api_lambda.data.external.archive_prepare[0]: Reading...
module.processing_lambda.data.external.archive_prepare[0]: Reading...
module.apply_schema_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.apply_schema_lambda.local_file.archive_plan[0]: Refreshing state... [id=a3ff0185b97cb42f4e54a01ceea938414b8efd86]
module.apply_schema_lambda.null_resource.archive[0]: Refreshing state... [id=8856732870441294041]
module.apply_schema_lambda.terraform_data.package_filename_for_hash[0]: Refreshing state... [id=f2957434-80d4-842b-9537-e39a5efbda7b]
module.ingestion_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.ingestion_lambda.local_file.archive_plan[0]: Refreshing state... [id=d3014f1369704ab5be69bb2411d1da3707ca1644]
module.ingestion_lambda.null_resource.archive[0]: Refreshing state... [id=690513367349632752]
module.api_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.api_lambda.local_file.archive_plan[0]: Refreshing state... [id=490c881ddb411cf237edbf978787ec5f05121bad]
module.reprocess_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.reprocess_lambda.local_file.archive_plan[0]: Refreshing state... [id=a0f359010e53cd5170e482183338600bc0aa72cd]
module.sync_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.api_lambda.null_resource.archive[0]: Refreshing state... [id=9143252321905343646]
module.sync_lambda.local_file.archive_plan[0]: Refreshing state... [id=5b89c0ec754c16609917f96581d81f1474385159]
module.weekly_report_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.processing_lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.sync_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-sync]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a0ed0489aafa6f11]
module.reprocess_lambda.data.aws_partition.current: Reading...
aws_sns_topic.weekly_report: Refreshing state... [id=arn:aws:sns:us-east-1:900881668640:gov-graph-weekly-report]
module.reprocess_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.weekly_report_lambda.data.aws_region.current: Reading...
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=em9az8nzqf]
aws_cloudwatch_event_rule.weekly_report_schedule: Refreshing state... [id=gov-graph-weekly-report]
module.sqs.data.aws_caller_identity.current[0]: Reading...
module.weekly_report_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.reprocess_lambda.null_resource.archive[0]: Refreshing state... [id=6624230240241482950]
module.sqs.data.aws_caller_identity.current[0]: Read complete after 0s [id=900881668640]
module.ingestion_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-ingestion]
module.sqs.aws_sqs_queue.dlq[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/900881668640/gov-graph-contract-queue-dlq]
module.apply_schema_lambda.data.aws_caller_identity.current: Reading...
module.weekly_report_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-weekly-report]
module.apply_schema_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.api_gateway.aws_cloudwatch_log_group.this["this"]: Refreshing state... [id=/aws/apigateway/gov-graph-http/default]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.api_lambda.data.aws_partition.current: Reading...
module.api_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.apply_schema_lambda.data.aws_region.current: Reading...
module.apply_schema_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ingestion_lambda.data.aws_partition.current: Reading...
module.ingestion_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
aws_budgets_budget.cost_control: Refreshing state... [id=900881668640:gov-graph-monthly-budget]
module.weekly_report_lambda.data.aws_partition.current: Reading...
module.weekly_report_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.apply_schema_lambda.data.aws_partition.current: Reading...
module.apply_schema_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.processing_lambda.data.aws_caller_identity.current: Reading...
module.weekly_report_lambda.data.aws_caller_identity.current: Reading...
module.ingestion_lambda.data.aws_region.current: Reading...
module.processing_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.ingestion_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.sync_lambda.null_resource.archive[0]: Refreshing state... [id=7500262538469394439]
module.fck_nat.data.aws_ami.main[0]: Reading...
module.weekly_report_lambda.local_file.archive_plan[0]: Refreshing state... [id=143d5300e4a91d0b5f6b70ac145127304ffcdcec]
module.fck_nat.data.aws_caller_identity.current: Reading...
module.weekly_report_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.api_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.weekly_report_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
aws_dynamodb_table.entity_cache: Refreshing state... [id=gov-graph-entity-cache]
module.fck_nat.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
aws_secretsmanager_secret.sam_api_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:900881668640:secret:gov-graph/sam-api-key-otjedi]
module.api_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
aws_secretsmanager_secret.neo4j_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:900881668640:secret:gov-graph/neo4j-credentials-otjedi]
module.weekly_report_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.processing_lambda.data.aws_region.current: Reading...
module.processing_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.sqs.data.aws_region.current[0]: Reading...
module.processing_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-processing]
module.sqs.data.aws_partition.current[0]: Reading...
module.sqs.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.sqs.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.api_lambda.data.aws_region.current: Reading...
module.api_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ingestion_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.apply_schema_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.processing_lambda.data.aws_partition.current: Reading...
module.apply_schema_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.processing_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.reprocess_lambda.data.aws_caller_identity.current: Reading...
module.processing_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.processing_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=gov-graph-postgres-db-20260216212626761700000003]
module.reprocess_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.reprocess_lambda.data.aws_region.current: Reading...
module.reprocess_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.reprocess_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.reprocess_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sync_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sync_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
aws_cloudwatch_event_rule.daily_ingestion: Refreshing state... [id=gov-graph-daily-ingestion]
aws_s3_bucket.lambda_builds: Refreshing state... [id=gov-graph-lambda-builds-df08fa12]
module.sync_lambda.data.aws_partition.current: Reading...
module.sync_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.api_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-api]
module.sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/900881668640/gov-graph-contract-queue]
aws_s3_bucket.raw_data: Refreshing state... [id=govgraph-raw-data-df08fa12]
module.sync_lambda.data.aws_region.current: Reading...
module.sync_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.sync_lambda.data.aws_caller_identity.current: Reading...
aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_gXSszxI6o]
module.sync_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.apply_schema_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-apply-schema]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
aws_cloudwatch_event_rule.daily_sync: Refreshing state... [id=gov-graph-daily-sync]
module.fck_nat.data.aws_ami.main[0]: Read complete after 0s [id=ami-0bdee4ce8b0dab1d0]
module.fck_nat.data.aws_iam_policy_document.instance_assume_role_policy: Reading...
module.fck_nat.data.aws_iam_policy_document.instance_assume_role_policy: Read complete after 0s [id=2851119427]
module.fck_nat.data.aws_region.current: Reading...
module.fck_nat.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.reprocess_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/gov-graph-reprocess]
module.api_lambda.data.aws_caller_identity.current: Reading...
module.processing_lambda.local_file.archive_plan[0]: Refreshing state... [id=a0f359010e53cd5170e482183338600bc0aa72cd]
module.api_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.reprocess_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.ingestion_lambda.data.aws_caller_identity.current: Reading...
aws_sns_topic_subscription.weekly_report_email: Refreshing state... [id=arn:aws:sns:us-east-1:900881668640:gov-graph-weekly-report:ba96a22a-ff20-4476-9e6a-a8cfa74a18e8]
module.ingestion_lambda.data.aws_caller_identity.current: Read complete after 0s [id=900881668640]
module.api_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.ingestion_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.apply_schema_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.api_gateway.aws_apigatewayv2_stage.this[0]: Refreshing state... [id=$default]
module.api_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
module.api_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-api]
module.reprocess_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
module.weekly_report_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-weekly-report]
module.ingestion_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
module.weekly_report_lambda.null_resource.archive[0]: Refreshing state... [id=4024466864593342112]
module.apply_schema_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-apply-schema]
module.ingestion_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-ingestion]
module.processing_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.apply_schema_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
module.processing_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-processing]
module.reprocess_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-reprocess]
module.sync_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=gov-graph-sync]
module.processing_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
module.sync_lambda.data.aws_iam_policy.vpc[0]: Reading...
module.sqs.aws_sqs_queue_redrive_allow_policy.dlq[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/900881668640/gov-graph-contract-queue-dlq]
module.sqs.aws_sqs_queue_redrive_policy.dlq[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/900881668640/gov-graph-contract-queue]
module.fck_nat.aws_iam_role.main: Refreshing state... [id=gov-graph-vpc-dev-fck-nat]
module.fck_nat.data.aws_iam_policy_document.main: Reading...
module.fck_nat.data.aws_iam_policy_document.main: Read complete after 0s [id=4163073303]
module.processing_lambda.null_resource.archive[0]: Refreshing state... [id=347837389954007401]
aws_s3_bucket_server_side_encryption_configuration.lambda_builds: Refreshing state... [id=gov-graph-lambda-builds-df08fa12]
module.sync_lambda.data.aws_iam_policy.vpc[0]: Read complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaENIManagementAccess]
aws_s3_bucket_public_access_block.lambda_builds: Refreshing state... [id=gov-graph-lambda-builds-df08fa12]
module.weekly_report_lambda.terraform_data.package_filename_for_hash[0]: Refreshing state... [id=ba8ec5dd-5d12-8a8f-4534-22c2c1520421]
aws_s3_bucket_public_access_block.raw_data: Refreshing state... [id=govgraph-raw-data-df08fa12]
aws_s3_bucket_lifecycle_configuration.raw_data: Refreshing state... [id=govgraph-raw-data-df08fa12]
aws_s3_bucket_server_side_encryption_configuration.raw_data: Refreshing state... [id=govgraph-raw-data-df08fa12]
aws_cognito_user_pool_domain.main: Refreshing state... [id=gov-graph-auth]
aws_cognito_identity_provider.google[0]: Refreshing state... [id=us-east-1_gXSszxI6o:Google]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01a16e51bf6562fe1]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-00df93395a3de1b99]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d4177696b68125d9]
aws_cloudwatch_dashboard.main: Refreshing state... [id=gov-graph-pipeline]
module.fck_nat.aws_iam_policy.main: Refreshing state... [id=arn:aws:iam::900881668640:policy/gov-graph-vpc-dev-fck-nat]
module.api_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-api:gov-graph-api-vpc]
module.weekly_report_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.weekly_report_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3090105299]
module.sync_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-ingestion:gov-graph-ingestion-vpc]
module.sync_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2114500597]
module.ingestion_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=784662949]
module.apply_schema_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-apply-schema:gov-graph-apply-schema-vpc]
module.processing_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-processing:gov-graph-processing-vpc]
module.sync_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-sync:gov-graph-sync-vpc]
module.processing_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.processing_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2336315575]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-053e772fde1a62252]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f880cf677712bd79]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a2be6d5196ca77fb]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0fe63ecf679aab38c]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-08fb9e80128439196]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-02c0d73f58d96bc72]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-01fa06d6419a969fa]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0b1d17136f1fb8e8f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-058b44ace592a9d57]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e39574bd48e8a571]
module.api_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.api_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2835697535]
module.fck_nat.aws_iam_instance_profile.main: Refreshing state... [id=gov-graph-vpc-dev-fck-nat]
module.apply_schema_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.apply_schema_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1533766019]
module.reprocess_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.reprocess_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3132420699]
module.reprocess_lambda.aws_iam_role_policy.vpc[0]: Refreshing state... [id=gov-graph-reprocess:gov-graph-reprocess-vpc]
module.weekly_report_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-weekly-report:gov-graph-weekly-report-logs]
module.sync_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-sync:gov-graph-sync-logs]
module.ingestion_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-ingestion:gov-graph-ingestion-logs]
aws_cognito_user_pool_client.frontend: Refreshing state... [id=1af9t6fgqmlo17dn62gfg7vo43]
module.fck_nat.data.aws_vpc.main: Reading...
module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0de6c293b57a4ea11]
module.processing_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-processing:gov-graph-processing-logs]
module.fck_nat.aws_iam_role_policy_attachment.main: Refreshing state... [id=gov-graph-vpc-dev-fck-nat/arn:aws:iam::900881668640:policy/gov-graph-vpc-dev-fck-nat]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-053e772fde1a622521080289494]
module.api_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-api:gov-graph-api-logs]
module.apply_schema_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-apply-schema:gov-graph-apply-schema-logs]
module.reprocess_lambda.aws_iam_role_policy.logs[0]: Refreshing state... [id=gov-graph-reprocess:gov-graph-reprocess-logs]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=gov-graph-vpc-dev]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-061cb41b48b613f77]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0fcc481f54846413c]
aws_amplify_app.frontend: Refreshing state... [id=d2680fpqajv7av]
module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-2791188885]
module.security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1130667915]
module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-1413376883]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-04fd6faea2d1413d6]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-020750015273cd590]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-088dfc22780587dd6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07d9483c03bec6d1c]
aws_amplify_branch.main: Refreshing state... [id=d2680fpqajv7av/main]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05877bb5be33f8d6a]
module.fck_nat.data.aws_vpc.main: Read complete after 1s [id=vpc-0a0ed0489aafa6f11]
aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0953c0cac84d820cb]
module.fck_nat.aws_security_group.main: Refreshing state... [id=sg-0b8ea77d68c03f5d0]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-V6ATTPOIWYN5EEL3ZFJOES36PI]
module.fck_nat.aws_network_interface.main: Refreshing state... [id=eni-08e6dfa52ca9841ea]
module.fck_nat.aws_route.main["private-1"]: Refreshing state... [id=r-rtb-0b1d17136f1fb8e8f1080289494]
module.fck_nat.aws_route.main["private-0"]: Refreshing state... [id=r-rtb-01fa06d6419a969fa1080289494]
module.fck_nat.data.cloudinit_config.this: Reading...
module.fck_nat.data.cloudinit_config.this: Read complete after 0s [id=3932343572]
module.fck_nat.aws_launch_template.main: Refreshing state... [id=lt-08e45fb35ee00a9be]
module.apply_schema_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-apply-schema:gov-graph-apply-schema]
module.api_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-api:gov-graph-api]
module.processing_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-processing:gov-graph-processing]
module.ingestion_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-ingestion:gov-graph-ingestion]
module.reprocess_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-reprocess:gov-graph-reprocess]
module.sync_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-sync:gov-graph-sync]
module.fck_nat.aws_autoscaling_group.main[0]: Refreshing state... [id=gov-graph-vpc-dev-fck-nat]
data.external.build_layer: Still reading... [00m10s elapsed]
data.external.build_layer: Read complete after 11s [id=-]
aws_s3_object.layer_zip: Refreshing state... [id=gov-graph-lambda-builds-df08fa12/layer-15c69dd0399dcf55e80a23730ffd0240.zip]
aws_lambda_layer_version.dependencies: Refreshing state... [id=arn:aws:lambda:us-east-1:900881668640:layer:gov-graph-dependencies:17]
module.apply_schema_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-apply-schema]
module.processing_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-processing]
module.reprocess_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-reprocess]
module.ingestion_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-ingestion]
module.api_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-api]
module.sync_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-sync]
aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowExecutionFromEventBridge]
aws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_cloudwatch_event_target.ingestion_target: Refreshing state... [id=gov-graph-daily-ingestion-IngestionLambda]
aws_apigatewayv2_integration.api_lambda: Refreshing state... [id=pwjj4wa]
aws_lambda_permission.allow_eventbridge_sync: Refreshing state... [id=AllowExecutionFromEventBridge]
module.processing_lambda.aws_lambda_event_source_mapping.this["sqs"]: Refreshing state... [id=97ab914b-92a3-4bcc-9800-2ef782e75342]
module.weekly_report_lambda.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=gov-graph-weekly-report:gov-graph-weekly-report]
aws_cloudwatch_event_target.sync_target: Refreshing state... [id=gov-graph-daily-sync-SyncLambda]
module.weekly_report_lambda.aws_lambda_function.this[0]: Refreshing state... [id=gov-graph-weekly-report]
aws_apigatewayv2_route.default: Refreshing state... [id=ukh93ak]
aws_lambda_permission.allow_eventbridge_weekly_report: Refreshing state... [id=AllowExecutionFromEventBridge]
aws_cloudwatch_event_target.weekly_report_target: Refreshing state... [id=gov-graph-weekly-report-WeeklyReportLambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_cognito_identity_provider.google[0] will be updated in-place
  ~ resource "aws_cognito_identity_provider" "google" {
        id                = "us-east-1_gXSszxI6o:Google"
      ~ provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields=" -> null
          - "attributes_url_add_attributes" = "true" -> null
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth" -> null
          - "oidc_issuer"                   = "https://accounts.google.com" -> null
          - "token_request_method"          = "POST" -> null
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token" -> null
            # (3 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.api_lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/3e35ad7474da97badcb0d3a3495359d889942235888961fa856f813a5ec37054.zip" -> "builds/a5e69292e8442054e5ad96e9f7a910d1cd14fcb37ed00580156afecc6e30da4f.zip"
        id                             = "gov-graph-api"
      ~ last_modified                  = "2026-03-25T19:45:26.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (30 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.api_lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a5e69292e8442054e5ad96e9f7a910d1cd14fcb37ed00580156afecc6e30da4f.plan.json"
      + id                   = (known after apply)
    }

  # module.api_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9143252321905343646" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3e35ad7474da97badcb0d3a3495359d889942235888961fa856f813a5ec37054.zip" -> "builds/a5e69292e8442054e5ad96e9f7a910d1cd14fcb37ed00580156afecc6e30da4f.zip"
          ~ "timestamp" = "1774467911011682000" -> "1774470835287620000"
        }
    }

  # module.apply_schema_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8856732870441294041" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1774467910962248000" -> "1774470835177802000"
            # (1 unchanged element hidden)
        }
    }

  # module.ingestion_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "690513367349632752" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1774467911033905000" -> "1774470835249439000"
            # (1 unchanged element hidden)
        }
    }

  # module.processing_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "347837389954007401" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1774467911025495000" -> "1774470835337557000"
            # (1 unchanged element hidden)
        }
    }

  # module.reprocess_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6624230240241482950" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1774467910999183800" -> "1774470835278361000"
            # (1 unchanged element hidden)
        }
    }

  # module.sync_lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7500262538469394439" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1774467911055725000" -> "1774470835317785000"
            # (1 unchanged element hidden)
        }
    }

Plan: 7 to add, 2 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>